; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   green_block_1 brown_block_1 grey_block_1 green_block_2 white_block_1 brown_block_2 green_block_3 - block
 )
 (:init (ontable green_block_1) (on brown_block_1 green_block_1) (on grey_block_1 brown_block_1) (ontable green_block_2) (on white_block_1 green_block_2) (on brown_block_2 white_block_1) (on green_block_3 brown_block_2) (clear grey_block_1) (clear green_block_3) (handempty) (= (total-cost) 0))
 (:goal (and (ontable brown_block_2)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack green_block_3 brown_block_2)
   deleted: (on green_block_3 brown_block_2) (clear green_block_3) (handempty)
   added: (holding green_block_3) (clear brown_block_2)
   goals met: 0 of 1
2. (putdown green_block_3)
   deleted: (holding green_block_3)
   added: (clear green_block_3) (handempty) (ontable green_block_3)
   goals met: 0 of 1
3. (unstack brown_block_2 white_block_1)
   deleted: (on brown_block_2 white_block_1) (clear brown_block_2) (handempty)
   added: (holding brown_block_2) (clear white_block_1)
   goals met: 0 of 1
4. (putdown brown_block_2)
   deleted: (holding brown_block_2)
   added: (clear brown_block_2) (handempty) (ontable brown_block_2)
   goals met: 1 of 1
